Tekla Open API Reference for Tekla Structures 2025
PickerInputTwoPoints Constructor
 Creates a new PickerInputTwoPoints instance with two points selected in a view.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PickerInputTwoPoints(
	ViewBase pickedView,
	Point firstPickedPoint,
	Point secondPickedPoint
)
Public Sub New (
	pickedView As ViewBase,
	firstPickedPoint As Point,
	secondPickedPoint As Point
)
Parameters
pickedView
Type: Tekla.Structures.Drawing.ViewBase
The view in which the pick occurred.
firstPickedPoint
Type: Tekla.Structures.Geometry3d.Point
The first picked point in the view coordinates.
secondPickedPoint
Type: Tekla.Structures.Geometry3d.Point
The second picked point in the view coordinates.
See Also
Reference
PickerInputTwoPoints Class
Tekla.Structures.Drawing Namespace